## Pandas

In [107]:
import numpy as np
import pandas as pd
import sys
import os
import matplotlib.pyplot as plt
import csv
import json
import io
import requests
import sqlite3
import sqlalchemy

In [3]:
a = np.arange(10*10).reshape(10, 10)


cols =[chr(i) for i in range(65, 75)]
rows =[chr(i) for i in range(97, 107)]
df1 = pd.DataFrame(a, columns = cols, index = rows)
df1

    A   B   C   D   E   F   G   H   I   J
a   0   1   2   3   4   5   6   7   8   9
b  10  11  12  13  14  15  16  17  18  19
c  20  21  22  23  24  25  26  27  28  29
d  30  31  32  33  34  35  36  37  38  39
e  40  41  42  43  44  45  46  47  48  49
f  50  51  52  53  54  55  56  57  58  59
g  60  61  62  63  64  65  66  67  68  69
h  70  71  72  73  74  75  76  77  78  79
i  80  81  82  83  84  85  86  87  88  89
j  90  91  92  93  94  95  96  97  98  99

#  read_csv

In [4]:
#reletive path
df2 = pd.read_csv("./Data/abc.csv")
print(df2)
# df2 = pd.read_csv("./Data/abc.csv", header = None)
# df2 = pd.read_csv("./Data/abc.csv", names=['A', 'B', 'C', 'D', 'Message'])
# names=['A', 'B', 'C', 'D', 'Message']
# df2 = pd.read_csv("./Data/abc.csv",names=names, index_col='Message')
df2 = pd.read_csv("./Data/abc.csv", skiprows=[1,3])

df2.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

   a  b  c  d message
0  5  6  7  8   world

In [5]:
parsed = pd.read_csv("./Data/csv_multi_ind.csv")
parsed = pd.read_csv("./Data/csv_multi_ind.csv", index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [6]:
# list(open("./Data/ex3.csv"))
# df3 = pd.read_csv("./Data/ex3.csv")
# df3 = pd.read_csv("./Data/ex3.csv", sep='\s+')
df3 = pd.read_table("./Data/ex3.csv", '\s+')
df3

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [7]:
result = pd.read_csv('./Data/ex4.csv')
# result = pd.read_csv('./Data/ex4.csv', na_values=['NULL'])  # NA values are marked as sentinel
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
result = pd.read_csv('./Data/ex4.csv', na_values=sentinels)
# print(pd.isnull(result))

result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [8]:
pd.options.display.max_rows  = 10   # set displayable rows
# df2 = pd.read_csv("./Data/train.csv")
# df2 = pd.read_csv("./Data/train.csv", nrows=55)
chunker = pd.read_csv("./Data/train.csv", chunksize=200)
# chunker

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['Embarked'].value_counts(), fill_value = 0)
    tot = tot.sort_values(ascending=False)
tot

S    644.0
C    168.0
Q     77.0
dtype: float64

In [9]:
r_table = pd.read_table("./Data/abc.csv", sep=",")
r_table

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
df3 = pd.read_csv('./Data/ex4.csv')
# df3
df3.to_csv('./Data/out.csv')
df3

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

###  to_csv

In [11]:
df3.to_csv(sys.stdout, sep = '|')
df3

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
# df3.to_csv(sys.stdout, na_rep='NULL', sep='|')
# df3.to_csv(sys.stdout, index = False, header =False)
df3.to_csv(sys.stdout, index=False, columns=['b', 'c', 'a', 'message'])
df3

b,c,a,message
2,3.0,1,
6,,5,world
10,11.0,9,foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [13]:
dates = pd.date_range(1/1/2021, periods=7)
ts = pd.Series(np.arange(7), index=dates) # timeseries
# ts.to_csv('./Date/timeSeries.csv') # Try this in some other IDE
ts

1970-01-01    0
1970-01-02    1
1970-01-03    2
1970-01-04    3
1970-01-05    4
1970-01-06    5
1970-01-07    6
Freq: D, dtype: int32

###

In [14]:
# f = open('./Data/ex6.csv')
# f_reader = csv.reader(f)
# for i in f_reader:
#     print(i)
with open('./Data/ex6.csv') as f:
    lines = list(csv.reader(f))
lines
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header , zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [15]:
f = open('./Data/ex6.csv')
reader = csv.reader(f, dialect='excel')
for i in reader:
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [16]:
with open('./Data/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect='excel')
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [17]:
with open('./Data/mydata.csv') as f:
    for i in f:
        print(i)

one,two,three



1,2,3



4,5,6



7,8,9

# json

In [18]:
obj = """
{"name": "Wes",
    "places_lived": ["United States", "Spain", "Germany"],
    "pet": null,
    "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                    {"name": "Katie", "age": 38,
                     "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [19]:
result = json.loads(obj)

asjson = json.dumps(result)
asjson
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [20]:
jsn = pd.read_json('./Data/data1.json')
jsn

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### to_json

In [21]:
print(jsn.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [22]:
# print(jsn.to_json(orient='records'))
# print(jsn.to_json(orient='values'))
# print(jsn.to_json(orient='table'))
print(jsn.to_json(orient='split'))

{"columns":["a","b","c"],"index":[0,1,2],"data":[[1,2,3],[4,5,6],[7,8,9]]}

# xml and html

In [23]:
html_df = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
html_df

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [24]:
html_df1 = pd.read_html('./Data/FDIC _ Failed Bank List.html')
len(html_df1)
table = html_df1[0]
# table.to_csv('./Data/html_to.csv')
# table.to_json('./Data/html_to.json')
table

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
7,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
8,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
9,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
10,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"
11,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017"

In [25]:
close_time = pd.to_datetime(table['Closing Date'])
close_time

# close_time.dt.year.value_counts()

0    2020-10-23
1    2020-10-16
2    2020-04-03
3    2020-02-14
4    2019-11-01
        ...
7    2019-05-31
8    2017-12-15
9    2017-10-13
10   2017-05-26
11   2017-05-05
Name: Closing Date, Length: 12, dtype: datetime64[ns]

#### exl and lxml

In [26]:
from lxml import objectify

# parsed = objectify.parse(open('./Data/mta.xml'))
parsed = objectify.parse(open('./Data/Performance_MNR.xml'))
root = parsed.getroot()
# root    # yields as generator object
data = []
skip_fileds = ['PARENT_SEQ', 'INDICATOR_SEQ',
'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elm in root.getchildren():
    el_data = {}
    for child in elm.getchildren():
        if child.tag in skip_fileds:
            continue
        el_data[child.tag] = child.text
    data.append(el_data)
#     print(el_data)

data_df = pd.DataFrame(data)
data_df.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.00,96.90,95.00,96.90
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.00,96.00,95.00,95.00
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.00,96.30,95.00,96.90
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.00,96.80,95.00,98.30
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.00,96.60,95.00,95.80

In [27]:
# returns empty dataset
Columns:[]
Index: []

In [31]:
parsed1 = objectify.parse(open('./Data/Performance_MNR.xml')) # StringIO() can be use instead of open() to parse
canmta_root = parsed1.getroot()
# mta_root.getchildren()
# mta_root

In [32]:
from io import StringIO 
tag = '<link rel="stylesheet" href="chrome://resources/css/text_defaults_md.css">Added closing tag explicitly</link>' # there must be an opening and closing tag
# tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()
print(root.get('href'))
print(root.get('rel'))
print(root.text)

chrome://resources/css/text_defaults_md.css
stylesheet
Added closing tag explicitly

#  Binary Data Formats

In [33]:
bin_df = pd.read_csv('./Data/abc.csv')
bin_df
bin_df.to_pickle('./Data/picked_abc.bin')

In [34]:

bin_df = pd.read_csv('./Data/abc.csv')
print(bin_df)
%time

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo
Wall time: 0 ns

In [35]:
# reading pickled file
bin_pk = pd.read_pickle('./Data/picked_abc.bin')
print(bin_pk)
%time

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo
Wall time: 0 ns

# Using HDF5 Format

In [36]:
h5_df = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('./Data/hdf5_file.h5', complib="bzip2")
store['obj1'] = h5_df
store['obj1_col1'] = h5_df['a']
store
# hdf files acts similar to dict_like PAI
print(store['obj1'])
# print(h5_df)

           a
0  -0.280058
1  -0.358167
2  -1.538631
3  -0.164230
4   1.353095
..       ...
95  0.201950
96 -1.513232
97 -1.957481
98 -0.496357
99 -0.226605

[100 rows x 1 columns]

In [37]:
store.put('obj_1', h5_df, format = 'table')

In [38]:
store.select('obj_1', where = ['index <=20'])

           a
0  -0.280058
1  -0.358167
2  -1.538631
3  -0.164230
4   1.353095
..       ...
16 -0.171170
17 -0.355510
18  1.332425
19 -0.151430
20 -1.431395

[21 rows x 1 columns]

###  to_hdf

In [39]:
h5_df1 = pd.DataFrame({'a': np.random.randn(100)})
h5_df.to_hdf('./Data/hdf_file2.h5', 'obj2',format= 'table' )

In [40]:
pd.read_hdf('./Data/hdf_file2.h5', 'obj2')

           a
0  -0.280058
1  -0.358167
2  -1.538631
3  -0.164230
4   1.353095
..       ...
95  0.201950
96 -1.513232
97 -1.957481
98 -0.496357
99 -0.226605

[100 rows x 1 columns]

# Reading Microsoft Excel Files

In [41]:
exls = pd.ExcelFile("./Data/abc.xlsx")
pd.read_excel(exls, 'Sheet1')

   A    B  C
0  1  2.0  3
1  4  5.0  6
2  6  8.0  8
3  5  NaN  9

In [42]:
a_file = pd.read_hdf('./Data/hdf_file2.h5', 'obj2')
writer = pd.ExcelWriter('./Data/new.xlsx')
a_file.to_excel(writer, 'Sheet1')
writer.save()
# a_file
# a_file.to_excel('./Data/new.xlsx')  can also be used

In [43]:
pd.read_excel('./Data/new.xlsx', 'Sheet1')

    Unnamed: 0         a
0            0 -0.280058
1            1 -0.358167
2            2 -1.538631
3            3 -0.164230
4            4  1.353095
..         ...       ...
95          95  0.201950
96          96 -1.513232
97          97 -1.957481
98          98 -0.496357
99          99 -0.226605

[100 rows x 2 columns]

In [44]:
df2 = pd.read_excel("./Data/abc.xlsx", encoding='cp1252'). head()
df2

   A    B  C
0  1  2.0  3
1  4  5.0  6
2  6  8.0  8
3  5  NaN  9

# Interacting With Web SPIs

In [71]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
data = pd.DataFrame(resp)

data1 = resp.json()
data1[0]['node_id']

'MDExOlB1bGxSZXF1ZXN0NTY5OTk0MjEz'

In [79]:
issues = pd.DataFrame(data1, columns = ['title', 'number', 'html_url', 'state'])
issues

,title,number,html_url,state
0,CLN: remove unused arg from Index._get_unique_...,39689,https://github.com/pandas-dev/pandas/pull/39689,open
1,DOC: doc-string validation broken,39688,https://github.com/pandas-dev/pandas/issues/39688,open
2,DOC: Basic indexing on axis with Multiindex,39683,https://github.com/pandas-dev/pandas/issues/39683,open
3,PERF: special case numpy.dtype in is_extension...,39678,https://github.com/pandas-dev/pandas/pull/39678,open
4,Pandas dataframe pct_change function arguments,39672,https://github.com/pandas-dev/pandas/issues/39672,open
...,...,...,...,...
25,"BUG:weeks = df.groupby(['CUSTOMER_ID', 'SALES_...",39611,https://github.com/pandas-dev/pandas/issues/39611,open
26,BUG: Grouping by frequency doesn't preserve or...,39610,https://github.com/pandas-dev/pandas/issues/39610,open
27,QST: Is it intended that empty dictionary aggr...,39609,https://github.com/pandas-dev/pandas/issues/39609,open
28,BUG: `max` and `min` returns incorrect result,39607,https://github.com/pandas-dev/pandas/issues/39607,open
29,BUG: quantile for ExtensionArray,39606,https://github.com/pandas-dev/pandas/pull/39606,open

In [69]:
data.to_csv('./Data/web_data.csv')

In [70]:
pd.read_csv('./Data/web_data.csv')

      Unnamed: 0                                                  0
0              0  b'[{"url":"https://api.github.com/repos/pandas...
1              1  b'pandas","labels_url":"https://api.github.com...
2              2  b'hub.com/repos/pandas-dev/pandas/issues/39689...
3              3  b'/events","html_url":"https://github.com/pand...
4              4  b'","number":39689,"title":"CLN: remove unused...
...          ...                                                ...
1046        1046  b'thub.com/pandas-dev/pandas/pull/39606.diff",...
1047        1047  b'loses #xxxx\\r\\n- [x] tests added / passed\...
1048        1048  b'cs/dev/development/contributing.html#code-st...
1049        1049  b'rk for arbitrary EAs, but we only have tests...
1050        1050  b'\\nPart of the idea is to get the code out o...

[1051 rows x 2 columns]

In [59]:
# import os
# os.remove('./Data/web_data.csv')

# Interacting with Databases

In [82]:
# import sqlite3

In [86]:
query = """CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""

In [ ]:
con = sqlite3.connect('mydata.sqlite')
# con.execute(query)

In [91]:
con.commit()

In [92]:
data = [('Atlanta', 'Georgia', 1.25, 6),
    ('Tallahassee', 'Florida', 2.6, 3),
    ('Sacramento', 'California', 1.7, 5)]

In [94]:
statement = 'INSERT INTO test VALUES(?, ?, ?, ?)' # ADD AS MANY FIELDS AS REQUIRED
con.executemany(statement, data)

In [95]:
con.commit()

In [104]:
view_sql = con.execute('select * from test')
rows = view_sql.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [105]:
view_sql.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [106]:
pd.DataFrame(rows, columns=[x[0] for x in view_sql.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [108]:
import sqlalchemy as sqla

In [109]:
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
sql_db = sqla.create_engine('mysql://')